//==================================================================
// 
// ゲーム中に出現するオブジェクトを管理するクラス [ ga,eobject.cpp ]
// Author : Asuma Nishio
// 
//==================================================================

//***************************
// インクルードファイル
//***************************
#include "gameobject.h"

//=========================
// コンストラクタ
//=========================
CGameObject::CGameObject()
{
	// 値のクリア
}
//=========================
// デストラクタ
//=========================
CGameObject::~CGameObject()
{

}
//=========================
// 初期化処理
//=========================
HRESULT CGameObject::Init(void)
{

	return S_OK;
}
//=========================
// 終了処理
//=========================
void CGameObject::Uninit(void)
{

}
//=========================
// 更新処理
//=========================
void CGameObject::Update(void)
{

}