//==================================================================
// 
// ゲーム中に出現するオブジェクトを管理するクラス [ ga,eobject.h ]
// Author : Asuma Nishio
// 
//==================================================================

//***************************
// インクルードガード
//***************************
#pragma once

//******************************
// オブジェクト管理クラスを定義
//******************************
class CGameObject
{
public:
	// コンストラクタ・デストラクタ
	CGameObject();
	~CGameObject();

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:

};