//=========================================================
//
// チュートリアル処理 [ tutorial.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// チュートリアルシーンクラスを定義
//*********************************************************
class CTutorial : public CScene
{
public:
	// コンストラクタ・デストラクタ
	CTutorial();
	~CTutorial();

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 静的メンバ関数
	static CTutorial* Create(void);

private:
};
