//===============================================
//
// チュートリアル管理処理 [ tutorialmanager.cpp ]
// Author: Asuma Nishio
//
//===============================================

//******************************
// インクルードファイル
//******************************
#include "tutorialmanager.h"

//===================================
// コンストラクタ
//===================================
CTutorialManager::CTutorialManager()
{
	// 値のクリア
}
//===================================
// デストラクタ
//===================================
CTutorialManager::~CTutorialManager()
{

}
//===================================
// 初期化処理
//===================================
HRESULT CTutorialManager::Init(void)
{
	return S_OK;
}
//===================================
// 終了処理
//===================================
void CTutorialManager::Uninit(void)
{

}
//===================================
// 更新処理
//===================================
void CTutorialManager::Update(void)
{

}
//===================================
// 描画処理
//===================================
void CTutorialManager::Draw(void)
{

}
//===================================
// インスタンス取得
//===================================
CTutorialManager* CTutorialManager::GetInstance(void)
{
	static CTutorialManager pInstance;
	return &pInstance;
}
